; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph4 - mode
	infrared3 - mode
	image2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation7 - direction
	Star1 - direction
	Star8 - direction
	Star5 - direction
	Star4 - direction
	GroundStation6 - direction
	Star9 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 image2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph4)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet16)
	(supports instrument3 image1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star8)
	(supports instrument4 image2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph0)
	(supports instrument5 image2)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star9)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star2)
	(supports instrument7 image1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument9 spectrograph4)
	(supports instrument9 image1)
	(calibration_target instrument9 Star2)
	(calibration_target instrument9 Star9)
	(supports instrument10 spectrograph4)
	(supports instrument10 image2)
	(supports instrument10 infrared3)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
)
(:goal (and
	(pointing satellite3 Planet16)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Star12 spectrograph4)
	(have_image Phenomenon13 spectrograph4)
	(have_image Phenomenon14 image2)
	(have_image Star15 image1)
	(have_image Planet16 image2)
))

)

; plan
1. (turn_to satellite4 star2 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star2)
   goals met: 0 of 8
2. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 8
3. (calibrate satellite4 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 0 of 8
4. (turn_to satellite4 star11 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 star11)
   goals met: 0 of 8
5. (take_image satellite4 star11 instrument9 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 1 of 8
6. (turn_to satellite4 phenomenon13 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 8
7. (take_image satellite4 phenomenon13 instrument9 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 2 of 8
8. (turn_to satellite4 phenomenon10 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 8
9. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 2 of 8
10. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 2 of 8
11. (take_image satellite4 phenomenon10 instrument9 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 8
12. (turn_to satellite3 phenomenon14 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon14)
   goals met: 3 of 8
13. (take_image satellite3 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 8
14. (turn_to satellite3 planet16 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet16)
   goals met: 5 of 8
15. (take_image satellite3 planet16 instrument5 image2)
   added: (have_image planet16 image2)
   goals met: 6 of 8
16. (turn_to satellite4 star12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star12)
   goals met: 6 of 8
17. (take_image satellite4 star12 instrument9 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 7 of 8
18. (turn_to satellite4 star15 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star15)
   goals met: 7 of 8
19. (take_image satellite4 star15 instrument9 image1)
   added: (have_image star15 image1)
   goals met: 8 of 8
